<a href="https://colab.research.google.com/github/4nur4g/Time-Series-Analysis/blob/main/2_Creating_a_time_series_object_in_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### **Importing the packages**

In [1]:
import pandas as pd
import numpy as np

### **Importing Data**

In [2]:
raw_df = pd.read_csv('Index2018.csv')

In [19]:
df_copy = raw_df.copy()

### **Length of the Time Period**
* To create a time series dataframe we will have to convert our date columns to datetime format right now it is in string format.

In [20]:
df_copy.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [21]:
df_copy.date.describe()

count           6269
unique          6269
top       16/04/2013
freq               1
Name: date, dtype: object

* We can see date column is not in right format so the top value is random.
* So, first we will convert date column to date time format for that we will use *to_datetime*

In [22]:
'''
by doing datefirst True we are telling to_datetime that in our date column
day is the first value
'''
df_copy.date = pd.to_datetime(df_copy.date, dayfirst=True)

In [23]:
df_copy.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [24]:
df_copy.date.describe(datetime_is_numeric=True)

count                             6269
mean     2006-01-14 19:36:59.492759168
min                1994-01-07 00:00:00
25%                2000-01-11 00:00:00
50%                2006-01-12 00:00:00
75%                2012-01-19 00:00:00
max                2018-01-29 00:00:00
Name: date, dtype: object

* now we can see the starting date is 1994-01-07 and
end date is 2018-01-29.
* Now we have transform our date column in datetime format we can use this as *Index* for our timeseries.

### **Settting the Index**
* Now we will set the datetime column as Index to our dataset

In [25]:
df_copy.set_index('date', inplace=True)

In [26]:
df_copy.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### **Setting the desired frequency**

* Time series data requires the *constant frequency* that persists throughout the set.
* We will use *as_freq* method to set frequency on our dataset.
* The values this argument takes are
    1. 'h' : hourly
    2. 'm' : month
    3. 'd' : day
    4. 'a' : annual
* The dataset have daily closing prices of markets. So we will use 'd'.

In [27]:
df_copy = df_copy.asfreq('d')

In [28]:
df_copy.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-08     NaN      NaN      NaN       NaN
1994-01-09     NaN      NaN      NaN       NaN
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25

* We can see we have new rows because dataset have not every day recorded prices.
* But we don't want those dates which are not bussiness days.So, we will use *'b'*.

In [29]:
df_copy = df_copy.asfreq('b')

In [30]:
df_copy.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### **Handling Missing Values**

* We can use *'fillna()'* to fill up the missing values in our dataframe the simipliest methods are backfilling, frontfilling, assigning the same values to all time periods.

In [31]:
df_copy.columns

Index(['spx', 'dax', 'ftse', 'nikkei'], dtype='object')

In [32]:
# filling spx nan values with frontfill
df_copy.spx = df_copy.spx.fillna(method='ffill')

In [33]:
# fillling dax nan values with backfill
df_copy.ftse = df_copy.ftse.fillna(method='bfill')

In [34]:
# filling ftse nan values with mean
df_copy.dax = df_copy.dax.fillna(value=df_copy.dax.mean())

In [36]:
# filling the nikkei nan values with frontfill
df_copy.nikkei = df_copy.nikkei.fillna(method='ffill')

In [37]:
df_copy.isna().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

### **Simplifying the values**
* Now, we will only analyse a single column. So, we don't need other columns.

In [38]:
# drop multiple columns
# df_copy.drop(['ftse', 'dax', 'nikkei'], axis=1)

In [39]:
# create new dataframe
spx = pd.DataFrame(df_copy.spx)

In [40]:
spx.head()

               spx
date
1994-01-07  469.90
1994-01-10  475.27
1994-01-11  474.13
1994-01-12  474.17
1994-01-13  472.47

### **Splitting the Dataset**
* Most of the cases we shuffle data before crating models but in times series we don't do that because it relies on keeping the chronological order of the values

In [43]:
# we will find the length of dataset and split it into 80 and 20 percent
size = int(len(spx)*0.8)

In [44]:
df = spx.iloc[:size] #training
df_test = spx.iloc[size:] #test

In [45]:
df.tail()

                    spx
date
2013-04-01  1562.173837
2013-04-02  1570.252238
2013-04-03  1553.686978
2013-04-04  1559.979316
2013-04-05  1553.278930

In [46]:
df_test.head()

                    spx
date
2013-04-08  1563.071269
2013-04-09  1568.607909
2013-04-10  1587.731827
2013-04-11  1593.369863
2013-04-12  1588.854623